In [ ]:
from sqlalchemy import create_engine
import pandas as pd
import numpy as np

In [ ]:
# Dados da conexão
usuario = 'root'
senha = '********'
host = 'localhost'
porta = '3306'
banco = 'VendasDB'

# Criando a engine de conexão
engine = create_engine(f'mysql+mysqlconnector://{usuario}:{senha}@{host}:{porta}/{banco}')

In [ ]:
# Consultas do SQL
dCalendario_query = 'SELECT * FROM dCalendario'
dLojas_query = 'SELECT * FROM dLojas'
dProduto_query = 'SELECT * FROM dProduto'
fVendas_query = 'SELECT * FROM fVendas'

# Lendo os dados para um DataFrame
fVendas = pd.read_sql(fVendas_query, con=engine)
dLojas = pd.read_sql(dLojas_query, con=engine)
dProduto = pd.read_sql(dProduto_query, con=engine)
dCalendario = pd.read_sql(dCalendario_query, con=engine)

ETL - dCalendario

In [ ]:
# Mostrando as primeiras linhas de dCalendario
dCalendario.head()

,Ano,Mês,Nome do Mês,Trimestre,Dia,AnoMesNum,Semestre,Dia da Semana,Data,AnoSemestre,SemanaAno,SemanaMes,Nome do Semestre,Nome do Trimestre,Nome do Mês Abv,Nome da Semana Ano,Nome da Semana Mes,AnoMes
0,2007,1,Janeiro,1,7,200701,1,Domingo,07/01/2007,200701,2,2,S1,1º TRI,Jan,W2/07,W2,Jan/07
1,2007,1,Janeiro,1,8,200701,1,Segunda-Feira,08/01/2007,200701,2,2,S1,1º TRI,Jan,W2/07,W2,Jan/07
2,2007,1,Janeiro,1,9,200701,1,Terça-Feira,09/01/2007,200701,2,2,S1,1º TRI,Jan,W2/07,W2,Jan/07
3,2007,1,Janeiro,1,10,200701,1,Quarta-Feira,10/01/2007,200701,2,2,S1,1º TRI,Jan,W2/07,W2,Jan/07
4,2007,1,Janeiro,1,11,200701,1,Quinta-Feira,11/01/2007,200701,2,2,S1,1º TRI,Jan,W2/07,W2,Jan/07

In [ ]:
# Mostrando informações do DataFrame dCalendario
dCalendario.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1096 entries, 0 to 1095
Data columns (total 18 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Ano                 1096 non-null   int64
 1   Mês                 1096 non-null   int64
 2   Nome do Mês         1096 non-null   object
 3   Trimestre           1096 non-null   int64
 4   Dia                 1096 non-null   int64
 5   AnoMesNum           1096 non-null   int64
 6   Semestre            1096 non-null   int64
 7   Dia da Semana       1096 non-null   object
 8   Data                1096 non-null   object
 9   AnoSemestre         1096 non-null   int64
 10  SemanaAno           1096 non-null   int64
 11  SemanaMes           1096 non-null   int64
 12  Nome do Semestre    1096 non-null   object
 13  Nome do Trimestre   1096 non-null   object
 14  Nome do Mês Abv     1096 non-null   object
 15  Nome da Semana Ano  1096 non-null   object
 16  Nome da Semana Mes  1096 non-null   object
 17  AnoMes              1096 non-null   object
dtypes: int64(9), object(9)
memory usage: 154.2+ KB

In [ ]:
# Removendo colunas desnecessárias de dCalendario
dCalendario = dCalendario.drop(['Mês', 'AnoMesNum', 'AnoMes', 'Nome do Semestre', 'AnoSemestre', 'Semestre', 'Trimestre', 'Nome do Mês Abv', 'Nome da Semana Ano', 'Nome da Semana Mes'], axis=1)

In [ ]:
# Renomeiando algumas colunas de dCalendario
dCalendario.rename(columns={'Nome do Mês': 'Mês', 'Nome do Trimestre': 'Trimestre'}, inplace=True)

In [ ]:
# Mostrando as primeiras linhas atualizadas de dCalendario
dCalendario.head()

,Ano,Mês,Dia,Dia da Semana,Data,SemanaAno,SemanaMes,Trimestre
0,2007,Janeiro,7,Domingo,07/01/2007,2,2,1º TRI
1,2007,Janeiro,8,Segunda-Feira,08/01/2007,2,2,1º TRI
2,2007,Janeiro,9,Terça-Feira,09/01/2007,2,2,1º TRI
3,2007,Janeiro,10,Quarta-Feira,10/01/2007,2,2,1º TRI
4,2007,Janeiro,11,Quinta-Feira,11/01/2007,2,2,1º TRI

ETL - dLojas

In [ ]:
# Mostrando as primeiras linhas de dLojas
dLojas.head()

,IdLoja,TipoLoja,NomeLoja,DataAbertura,DataFechamento,CEP,Endereco
0,1,Store,Contoso Seattle No.1 Store,20/01/2007,,97001,East Queen Anne Big shopping mall
1,2,Online,Contoso Seattle No.2 Store,12/02/2007,,97001,East Queen Anne Big shopping mall
2,3,Store,Contoso Kennewick Store,12/02/2007,,97001,"Kennewick, Downtown"
3,4,Store,Contoso Bellevue Store,01/03/2007,,97001,West Lake Hills shopping mall
4,5,Store,Contoso Redmond No1. Store,02/04/2007,,97001,Downtown shopping mall

In [ ]:
# Mostrando informações do DataFrame dLojas
dLojas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   IdLoja          10 non-null     int64
 1   TipoLoja        10 non-null     object
 2   NomeLoja        10 non-null     object
 3   DataAbertura    10 non-null     object
 4   DataFechamento  10 non-null     object
 5   CEP             10 non-null     int64
 6   Endereco        10 non-null     object
dtypes: int64(2), object(5)
memory usage: 688.0+ bytes

In [ ]:
# Removendo colunas desnecessárias de dLojas
dLojas = dLojas.drop(['DataAbertura',	'DataFechamento', 'CEP', 'Endereco'], axis=1)

In [ ]:
# Mostrando as primeiras linhas atualizadas de dLojas
dLojas.head()

   IdLoja TipoLoja                    NomeLoja
0       1    Store  Contoso Seattle No.1 Store
1       2   Online  Contoso Seattle No.2 Store
2       3    Store     Contoso Kennewick Store
3       4    Store      Contoso Bellevue Store
4       5    Store  Contoso Redmond No1. Store

ETL - dProduto

In [ ]:
# Mostrando as primeiras linhas de dProduto
dProduto.head()

,IdProduto,NomeProduto,IdProdutoSubcategoria,Marca,Classe,Cor
0,842,Contoso Bright Light battery E20 Black,22,Contoso,Economy,Black
1,843,Contoso Bright Light battery E20 blue,22,Contoso,Economy,Blue
2,844,Contoso Bright Light battery E20 Pink,22,Contoso,Economy,Pink
3,845,Contoso Bright Light battery E20 White,22,Contoso,Economy,White
4,846,Contoso Ultraportable Neoprene Sleeve E30 Black,22,Contoso,Economy,Black

In [ ]:
# Mostrando informações do DataFrame dProduto
dProduto.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2394 entries, 0 to 2393
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   IdProduto              2394 non-null   int64
 1   NomeProduto            2394 non-null   object
 2   IdProdutoSubcategoria  2394 non-null   int64
 3   Marca                  2394 non-null   object
 4   Classe                 2394 non-null   object
 5   Cor                    2394 non-null   object
dtypes: int64(2), object(4)
memory usage: 112.3+ KB

In [ ]:
# Removendo colunas desnecessárias de dProduto
dProduto = dProduto.drop(['IdProdutoSubcategoria', 'Cor'], axis=1)

In [ ]:
# Mostrando as primeiras linhas atualizadas de dProduto
dProduto.head()

,IdProduto,NomeProduto,Marca,Classe
0,842,Contoso Bright Light battery E20 Black,Contoso,Economy
1,843,Contoso Bright Light battery E20 blue,Contoso,Economy
2,844,Contoso Bright Light battery E20 Pink,Contoso,Economy
3,845,Contoso Bright Light battery E20 White,Contoso,Economy
4,846,Contoso Ultraportable Neoprene Sleeve E30 Black,Contoso,Economy

ETL - fVendas

In [ ]:
# Mostrando as primeiras linhas de fVendas
fVendas.head()

,IdVenda,Data,IdLoja,IdProduto,CustoUnitario,PrecoUnitario,QtdVenda,QtdDevolucao,VlrDevolucao,VlrDesconto
0,29133,02/05/2008,5,848,"R$ 7,95","R$ 15,60",10,0,R$ 0,R$ 0
1,973276,01/10/2008,5,847,"R$ 7,95","R$ 15,60",10,0,R$ 0,R$ 0
2,558373,12/05/2008,5,870,"R$ 10,69","R$ 20,96",10,0,R$ 0,R$ 0
3,754202,07/05/2008,5,1267,"R$ 25,47","R$ 49,96",10,0,R$ 0,R$ 0
4,248559,07/06/2009,5,886,"R$ 49,70",R$ 150,10,0,R$ 0,R$ 0

In [ ]:
# Mostrando informações do DataFrame fVendas
fVendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 583 entries, 0 to 582
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   IdVenda        583 non-null    int64
 1   Data           583 non-null    object
 2   IdLoja         583 non-null    int64
 3   IdProduto      583 non-null    int64
 4   CustoUnitario  583 non-null    object
 5   PrecoUnitario  583 non-null    object
 6   QtdVenda       583 non-null    int64
 7   QtdDevolucao   583 non-null    int64
 8   VlrDevolucao   583 non-null    object
 9   VlrDesconto    583 non-null    object
dtypes: int64(5), object(5)
memory usage: 45.7+ KB

In [ ]:
# Subtituindo valores das colunas de fVendas
colunas = ['CustoUnitario', 'PrecoUnitario', 'VlrDevolucao', 'VlrDesconto']

for coluna in colunas:
    fVendas[coluna] = (
        fVendas[coluna]
        .str.replace('R$ ', '')
    )

for coluna in colunas:
    fVendas[coluna] = (
        fVendas[coluna]
        .str.replace('.', '')
    )


for coluna in colunas:
    fVendas[coluna] = (
        fVendas[coluna]
        .str.replace(',', '.')
    )

In [ ]:
# Convertendo os dados para float
fVendas[['CustoUnitario', 'PrecoUnitario', 'VlrDevolucao', 'VlrDesconto']] = fVendas[['CustoUnitario', 'PrecoUnitario', 'VlrDevolucao', 'VlrDesconto']].astype(float)

In [ ]:
# Criando coluna para calcular o total de vendas
fVendas['VlrVendido'] = fVendas['QtdVenda'] * fVendas['PrecoUnitario']

In [ ]:
# Mostrando as primeiras linhas de fVendas
fVendas.head()

,IdVenda,Data,IdLoja,IdProduto,CustoUnitario,PrecoUnitario,QtdVenda,QtdDevolucao,VlrDevolucao,VlrDesconto,VlrVendido
0,29133,02/05/2008,5,848,7.95,15.60,10,0,0.0,0.0,156.0
1,973276,01/10/2008,5,847,7.95,15.60,10,0,0.0,0.0,156.0
2,558373,12/05/2008,5,870,10.69,20.96,10,0,0.0,0.0,209.6
3,754202,07/05/2008,5,1267,25.47,49.96,10,0,0.0,0.0,499.6
4,248559,07/06/2009,5,886,49.70,150.00,10,0,0.0,0.0,1500.0

Salvando os DataFrames

In [ ]:
# Salvando os DataFrames, após o ETL no banco

dCalendario.to_sql('dCalendario_etl', con=engine, if_exists='replace', index=False)
dLojas.to_sql('dLojas_etl', con=engine, if_exists='replace', index=False)
dProduto.to_sql('dProduto_etl', con=engine, if_exists='replace', index=False)
fVendas.to_sql('fVendas_etl', con=engine, if_exists='replace', index=False)

583